УчетВУправляющихДляГит1/src/Documents/УведомлениеОСписанииКиЗГИСМ/УведомлениеОСписанииКиЗГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УведомлениеОСписанииКиЗГИСМ</name>
  <posting>Deny</posting>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеУведомленияОСписанииКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НомераКиЗ</name>
    <attributes>
      <name>Индивидуализирован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерКиЗ</name>
      <type>
        <types>DefinedType.НомерКиЗГИСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>RFIDTID</name>
      <type>
        <types>DefinedType.RFIDTID</types>
      </type>
    </attributes>
    <attributes>
      <name>RFIDEPC</name>
      <type>
        <types>DefinedType.RFIDEPC</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаСписания</name>
      <type>
        <types>EnumRef.ПричиныСписанияКиЗГИСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаНаВыпускКиЗ</name>
      <type>
        <types>DocumentRef.ЗаявкаНаВыпускКиЗГИСМ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УчетВУправляющихДляГит1/src/InformationRegisters/СтатусыИнформированияГИСМ/СтатусыИнформированияГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыИнформированияГИСМ</name>
  <resources>
    <name>ТекущееУведомление</name>
    <type>
      <types>DocumentRef.УведомлениеОбИмпортеМаркированныхТоваровГИСМ</types>
      <types>DocumentRef.УведомлениеОСписанииКиЗГИСМ</types>
      <types>DocumentRef.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыИнформированияГИСМ</types>
    </type>
  </resources>
  <resources>
    <name>ДальнейшееДействие</name>
    <type>
      <types>EnumRef.ДальнейшиеДействияПоВзаимодействиюГИСМ</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ДокументИнформированияГИСМ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/Enums/СтатусыИнформированияГИСМ/СтатусыИнформированияГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыИнформированияГИСМ</name>
  <enumValues>
    <name>Отсутствует</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>КПередаче</name>
  </enumValues>
  <enumValues>
    <name>КПередачеСписаниеКиЗ</name>
  </enumValues>
  <enumValues>
    <name>КПередачеМаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>КПередачеПеремаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>Передано</name>
  </enumValues>
  <enumValues>
    <name>ПереданоСписаниеКиЗ</name>
  </enumValues>
  <enumValues>
    <name>ПереданоМаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПереданоПеремаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоГИСМ</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоГИСМСписаниеКиЗ</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоГИСММаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоГИСМПеремаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПринятоГИСМ</name>
  </enumValues>
  <enumValues>
    <name>ПринятоГИСМСписаниеКиЗ</name>
  </enumValues>
  <enumValues>
    <name>ПринятоГИСММаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПринятоГИСМПеремаркировкаТоваров</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Documents/УведомлениеОСписанииКиЗГИСМ/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнтеграцияГИСМПереопределяемый.ОбработкаЗаполненияУведомленияОСписанииКиЗ(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ДополнительныеСвойства.Вставить("ЗаписьНового", Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	МассивНепроверяемыхРеквизитов.Добавить("НомераКиЗ.НомерКиЗ");
	МассивНепроверяемыхРеквизитов.Добавить("НомераКиЗ.RFIDTID");
	МассивНепроверяемыхРеквизитов.Добавить("НомераКиЗ.RFIDEPC");
	
	Если Не ИнтеграцияГИСМ.ИспользоватьВозможностиВерсии("2.41") Тогда
		МассивНепроверяемыхРеквизитов.Добавить("НомераКиЗ.ПричинаСписания");
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов.Добавить("НомераКиЗ.ЗаявкаНаВыпускКиЗ");
	
	Если ЭтоНовый() И ЗначениеЗаполнено(Основание) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Состояния.ТекущееУведомление
		|ИЗ
		|	РегистрСведений.СтатусыИнформированияГИСМ КАК Состояния
		|ГДЕ
		|	Состояния.Документ = &Основание
		|	И НЕ Состояния.Статус В (
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыИнформированияГИСМ.ОтклоненоГИСМ),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыИнформированияГИСМ.Отсутствует))
		|	И НЕ Состояния.ТекущееУведомление = ЗНАЧЕНИЕ(Документ.УведомлениеОСписанииКиЗГИСМ.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("Основание", Основание);
		
		Результат = Запрос.Выполнить();
		
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			
			ТекстОшибки = НСтр("ru='Для документа %1 уже существует текущая %2.'");
				ТекстОшибки =  СтрШаблон(ТекстОшибки, Основание, Выборка.ТекущееУведомление);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстОшибки,
					ЭтотОбъект,
					,
					,
					Отказ);
			
		КонецЕсли;
	КонецЕсли;
	
	Для каждого СтрокаНомераКиЗ Из НомераКиЗ Цикл
		
		//ГИСМБП
		// В БП у списанных товаров КиЗ всегда индивидуализирован
		//Конец ГИСМБП
		
		Если НЕ ЗначениеЗаполнено(СтрокаНомераКиЗ.НомерКиЗ)
			И НЕ ЗначениеЗаполнено(СтрокаНомераКиЗ.RFIDTID)
			И НЕ ЗначениеЗаполнено(СтрокаНомераКиЗ.RFIDEPC) Тогда
			
			НомерСтроки = СтрокаНомераКиЗ.НомерСтроки;
			
			ТекстОшибки = НСтр("ru='В строке %НомерСтроки% списка ""Товары"" не указан ни ""Номер КиЗ"", ни ""RFID TID"", ни ""RFID EPC""'");
			ТекстОшибки =  СтрЗаменить(ТекстОшибки, "%НомерСтроки%", НомерСтроки);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("НомераКиЗ", НомерСтроки, "НомерКиЗ"),
			,
			Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
